app/controllers/results_data_controller.rb

	def create
		result = ResultData.new(result_params)
		if result.save
---
INSERT INTO "result_data" ("subject", "timestamp", "marks", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["subject", "Science"], ["timestamp", "2022-04-18 05:46:34.678000"], ["marks", 106.0], ["created_at", "2024-07-24 11:50:27.820761"], ["updated_at", "2024-07-24 11:50:27.820761"]]

	def index
		@results=ResultData.all
---
SELECT "result_data".* FROM "result_data"